[
  {
    "url": "https://ricesub.in/",
    "title": "RiceSub",
    "scrapedAt": "2025-12-05T16:52:53.484Z",
    "textContent": "Skip to content\nMenu\nHOME\nABOUT RICE\nSTORIES\nPEOPLE\nGET INVOLVED\nTRANSPARENCY\nBLOG\n01-min\n02.2-min\nBishnupada Sarkar\nCdYpwSl\nCnxj9zK\nm9WsnTQ\n\nRICE (Resilience | Innovation | Culture | Empowerment) is a celebration of farmers living on the fringes of Sundarbans, the largest mangrove forest in the world. These farmers are facing a serious threat from climate change events like rising sea levels and erratic weather. Get to know about their lives at the edge of a global climate crisis as they share stories and songs about farming, the rice varieties they grow and stories of their resilience.\n\nYou may also find a rice variety that suits your taste, is packed with nutrition and does not offered at reasonable price.\n\nJoin RICE on social media platforms and become a part of this grassroots effort to mitigate climate change crisis.\n\nMangroves are one of the most powerful natural allies against climate change. They serve as efficient carbon sinks and shock absorbers during cyclones, floods and tsunamis. More than 4.5 million people live in the Indian side of Sundarbans. Many of them have lived close to the mangrove ecosystem for generations. Are these people helpless victims facing existential threats from climate change or can they become front runners in mitigating climate change risks? Together we can make that choice.\n\nVillages closest to the forests in Sundarbans have an agrarian economy, in what would otherwise have been a mangrove ecosystem. Restoring and developing harmonious relationships between humans and the mangrove ecosystems can make these communities truly climate risk resilient. RICE is a small step in this direction to support farmers. We welcome you to join in this journey with the farmers of Sundarbans and find beacons of hope.\n\nJoin RICE on social media platforms and become a part of this grassroots effort to mitigate the climate change crisis.\n\nFollow RICE on social media.     \n\n  \n \n\nABOUT RICE\n\n \n\nThe journey of RICE starts with the farmers of Kalitala, the last village on the banks of Kalindi tidal river at the border with Bangladesh. Nestled between the tidal rivers Kalindi and Raimangal, Kalitala is one of the closest human habitations to the Sunderbans on the Indian side and is vulnerable to climate change risks. In the recent past cyclones Fani, Bulbul, Amphan and Yaas have all devastated this village. In 2009 cyclone Aila caused saline water intrusion in the farmlands which adversely affected farming for almost four years. Many farmers failed to grow their crops because high yielding varieties (HYV) of rice have low tolerance for soil salinity.\n\nA few farmers re-introduced traditional varieties of rice, some of them known to be more tolerant to salinity. These are less labour intensive, require no chemical fertilizers and are cheaper to grow. The farmers were successful in growing 28 traditional varieties but could find neither the market nor fair prices for their produce. These rice varieties are tasty, have high nutritional values and are grown chemical free.\n\nRice consumers are unaware of these nutritious and healthy rice varieties. RICE is a way for the farmers to connect with you through their songs and stories, using social media as a bridge. These chemical free varieties of rice grown by them are accessible to you at affordable prices. You can support the farmers by buying their produce and contributing to making Sunderbans and its inhabitants more resilient to climate change risks. We hope that your contribution and involvement will keep the heritage alive and help in fostering a more harmonious relationship between the settled areas and the mangrove ecology of Sunderbans.\n\nRICE will seed innovation efforts and facilitate community ideas to mitigate climate change crisis and create other livelihood options in the settled areas.\n\nExamples of such efforts will be:\n\nExplore new ways of hosting indegenous Apis dorsata bees within settled areas to make honey collection safer for both humans and bees.\nEncouraging women-led enterprises to take up restoration of mangrove ecosystems\nMake homes of villagers in Sundarbans disaster resilient by using natural building materials and design innovations\n\n \n\nRICE STORIES\n\nInterview: Jyoti Mohan Roy\n\nJyoti shares his childhood memories about desi rice varieties like Gerimuri and Khejurchuri.\n\nInterview: Tarapada Gayen\n\nDo you know how many parts a plough has? Tarapada Gayen tells us about the various parts and their local names.\n\nInterview: Jyoti Mohan Roy\n\nFarmers grow different varieties of desi rice according to the terrain, low lying or higher lands. Undulation of any land, whether low lying or higher, determines what variety of desi rice will grow well there.\n\nSong: Bishnupada Sarkar\n\nModern industrial farming forces farmers to migrate to cities as labourers A song pointing out how modern industrial farming makes people jobless in their own villages, forcing them to migrate to cities as labourers\n\nInterview: Jolil Barkandaj\n\nArguments for choosing desi paddy varieties over high yielding varieties Would you risk your entire crop, just to get a slightly higher yield? Arguments for choosing desi paddy varieties over high yielding varieties.\n\nSong: Probir Mondal\n\nDespair felt by a farmer in Sundarbans; torn between the love & attachment for one's birthplace & uncertainties. A song expressing despair felt by a farmer in Sundarbans; torn between the love & attachment for one's birthplace and ever present uncertainties\n\nInterview: Tarak Mandal\n\nInsights of a landless share-cropper on work related migration. Tarak a landless sharecropper who migrates for at least 3 months in a year to work as an agricultural labourer provides an interesting insight\n\nInterview: Probir Mondal\n\n'8 bighas of desi paddy I grow can sustain upto 20 people for a year' Probir calculates that the 8 bighas of desi paddy that he has cultivated can sustain for a year, 20 people who eat rice as a staple.\n\nSong: Santosh Tarafdar\n\n'In the era of science, the tractor dominates. Farmers do not own seeds anymore. The 'market' determines everything! A song calling a spade a spade. In the era of science, the tractor dominates. Farmers do not own seeds anymore. The 'market' determines everything!\n\nInterview: Proshanto Baidya\n\nChildhood memories of desi paddy sown on flooded fields using a boat. Retrieved from childhood memories, a time when a desi paddy variety was sown on flooded fields using a boat, getting a full crop at the end of the season.\n\nInterview: Sita Biswas\n\nDo we imagine agriculture as an equal opportunity sector? Sita shares how she works shoulder to shoulder with her husband. Sita started learning farming when she was 10-12 years old, today she works shoulder to shoulder with her husband. Do we imagine agriculture as an equal opportunity sector?\n\nSong: Bishnupada Sarkar\n\nThe song questions farmers in Sundarbans. 'A lot has changed in their lives. Or has it?' A song that asks questions to farmers in Sundarbans. A lot has changed in their lives. Or has it?\n\nInterview: Rabindra Aulia\n\nWhy does a farmer continue to farm even when it is clear that the costs will not get recovered? Hear some hard truths about farming in Sunderbans from Rabindra.\n\nInterview: Jyoti Mohan Roy\n\nThe characteristics of a farmland (whether it is low lying and so likely to remain flooded longer or high ground which will not have water for long) determines which paddy variety is suitable to grow there. Watch Jyoti speak about how natural conditions during the farming season are closely connected with getting a good yield.\n\nInterview: Dheeman Boidya\n\nDheeman explains why it makes more economic sense for him to cultivate desi paddy in his land\n\nInterview: Palas Mondal\n\nPalas shares how farmers in Sundarbans invoke many gods and goddesses, hoping for a good crop. He speaks about some rituals like jal bhiksha (water begging)\n\nInterview: Jyoti Mohan Roy\n\nJyoti shares his childhood memories about desi rice varieties like Gerimuri and Khejurchuri.\n\nInterview: Tarapada Gayen\n\nDo you know how many parts a plough has? Tarapada Gayen tells us about the various parts and their local names.\n\nInterview: Jyoti Mohan Roy\n\nFarmers grow different varieties of desi rice according to the terrain, low lying or higher lands. Undulation of any land, whether low lying or higher, determines what variety of desi rice will grow well there.\n\nSong: Bishnupada Sarkar\n\nModern industrial farming forces farmers to migrate to cities as labourers A song pointing out how modern industrial farming makes people jobless in their own villages, forcing them to migrate to cities as labourers\n\nRICE PEOPLE\n\nAnanda Mistry\n\nAnanda’s love for the violin began 5-6 years ago. Farming and music are his two sources of livelihood and being able to continue his musical journey is his dream.\n\n\t\n\nBishnupada Sarkar\n\nBishnupada writes & sings songs about life in Sundarbans. He was an All India Radio artist. He loves the bhatiyali genre of Bengal’s folk music.\n\n\t\n\nBiswajit Bain\n\nBiswajit plays the drum. Pursuing music is the core purpose of his life. He hopes to continue his musical journey despite his family’s economic challenges.\n\n\n\n\nChapal Pramanik\n\nComing from a landless family, Chapal earns his living by playing the dotara and crab fishing. He is also considered to have green fingers.\n\n\t\n\nNibha Mondal\n\nNibha is a singer who is also responsible for coordinating with women's Self Help Groups in the village to reclaim women's traditional roles in rice processing.\n\n\t\n\nPalas Mondal\n\nA vocal artist who studied music at Rabindra Bharati University in Kolkata, Palas is a farmer and a grassroots activist.\n\n\n\n\nPinaki Roy\n\nA social worker by training, Pinaki believes that humanity, to survive on the earth, must align with nature and transform systems that don’t.\n\n\t\n\nPrabir Mondal\n\nFarming, cultural activities like music & acting and being an active & constructive member of the village community are important aspects life for Probir.\n\n\t\n\nRabiul Islam\n\nGrowing up in rural Bengal, Robi pursues a formal career in graphic designing. His dream is to make design education accessible to all for free.\n\n\n\n\nShruti Kulkarni\n\nShruti is an artist, poet and filmmaker, who lives in Bengaluru. One of her greatest joys is taking long walks through quiet wildernesses.\n\n\t\n\nTarapada Gayen\n\nA farmer, vermicomposter, cycle repair shop owner and traditional jatra form of theatre actor, Tarapada is a pioneer in trying to reintroduce traditional varieties of rice.\n\nGET INVOLVED\n\nPlease help us spread the word about RICE. Like us and follow us on Instagram, Facebook and YouTube.\n\nIf you love to eat rice and if you care about the Earth in general, purchasing desi rice grown by the farmers of Sundarbans can be one way of taking care of your health and the planet’s well-being.\n\nThe rice value chain is extremely complex. Paddy in these areas passes through at least 8 key milestones to reach a consumer (please see notes below).\n\nNo matter where you are based in India or across the world, you can contribute in the form of your unique skill-sets, relationships and ideas that can be invaluable for making farming in Sundarbans more disaster risk resilient and for making chemical free tasty rice varieties accessible to consumers at affordable prices.\n\nGet involved in the RICE journey, click here to help create value chains that ensure the wellbeing of farmers, consumers and entrepreneurs.\n\n1. Natural Systems – The undulation of a field, type of soil, how much it rains, when it rains, cyclones, floods, etc. all determine what can be grown or if it can be grown. If your expertise lies with the natural world, you can help in creating a more holistic understanding of the local ecosystem.\n\n2. Farmer’s wisdom & efforts – Observations, insights & skill-sets passed down through generations as wisdom; with years of practice and hard physical work. Often unacknowledged by society at large. If your skill sets can help document or communicate the wisdom then that is one way you can contribute.\n\n3. Scientific & technical inputs – Industrial farming practices with their chemical fertilizers and pesticides take a toll on the soil and also on us. Traditional wisdom may not be enough to heal the soil. Your support will be invaluable if you have a deep commitment towards the healing of soil and ecosystems and have the requisite expertise.\n\n4. Traders who buy paddy at the village – An important link – villagers themselves who must be an important part of the desi paddy value chain – for carrying a farmer’s produce to the outside world. If you are familiar with this usually neglected part of the value chain, your contribution can be invaluable.\n\n5. Wholesalers – Are stakeholders who infuse capital into the value chain at two points, dealing with first paddy and then rice. An insider in this segment, with a deep commitment to contribute towards a just and sustainable future of the planet – can totally transform the game.\n\n6. Millers – Brings in critical technology that transforms paddy into rice – which is mostly geared to process high-yielding varieties currently. A deep understanding of this business and how desi paddy varieties can be accommodated can help to make farming in Sundarbans more climate risk resilient.\n\n7. Retailers – The last mile connectors delivering the rice to consumers. If you are a retailer interested in making chemical free rice grown in Sundarbans accessible to consumers at affordable prices then your support will be invaluable.\n\n8. Consumers – This is all of us. Missing out by relying on the limited number of rice varieties that market forces bring to us. Ignorance is not bliss here. Start exploring, there are many rice varieties out there that are just right for your taste buds, health and wallet.\n\n©RICE. 2021\n\nHome\n\nAbout RICE\n\nStories\n\nPeople\n\nGet Involved\n\nTransparency\n\nRICE pilot was supported by ONGC CSR\n\nFacebook\n\nInstagram\n\nYoutube\n\nBlog\n\nPowered by Wherrelz IT Solutions Ltd",
    "images": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/cropped-rice-logo-04.jpg",
        "localPath": "assets/image_0.jpg",
        "alt": "RiceSub"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-1.jpg",
        "localPath": "assets/image_1.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-2.jpg",
        "localPath": "assets/image_2.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-5.jpg",
        "localPath": "assets/image_3.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-3.jpg",
        "localPath": "assets/image_4.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-4.jpg",
        "localPath": "assets/image_5.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Rice-Website-Banner-1350-x-400-6.jpg",
        "localPath": "assets/image_6.jpg",
        "alt": ""
      },
      {
        "originalSrc": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMzIiIGhlaWdodD0iMzIiIHZpZXdCb3g9IjAgMCAzMiAzMiIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KICAgIDxwYXRoIGQ9Ik0xMS40MzMgMTUuOTkyTDIyLjY5IDUuNzEyYy4zOTMtLjM5LjM5My0xLjAzIDAtMS40Mi0uMzkzLS4zOS0xLjAzLS4zOS0xLjQyMyAwbC0xMS45OCAxMC45NGMtLjIxLjIxLS4zLjQ5LS4yODUuNzYtLjAxNS4yOC4wNzUuNTYuMjg0Ljc3bDExLjk4IDEwLjk0Yy4zOTMuMzkgMS4wMy4zOSAxLjQyNCAwIC4zOTMtLjQuMzkzLTEuMDMgMC0xLjQybC0xMS4yNTctMTAuMjkiCiAgICAgICAgICBmaWxsPSIjZmZmZmZmIiBvcGFjaXR5PSIwLjgiIGZpbGwtcnVsZT0iZXZlbm9kZCIvPgo8L3N2Zz4=",
        "localPath": null,
        "alt": "previous arrow"
      },
      {
        "originalSrc": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMzIiIGhlaWdodD0iMzIiIHZpZXdCb3g9IjAgMCAzMiAzMiIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KICAgIDxwYXRoIGQ9Ik0xMC43MjIgNC4yOTNjLS4zOTQtLjM5LTEuMDMyLS4zOS0xLjQyNyAwLS4zOTMuMzktLjM5MyAxLjAzIDAgMS40MmwxMS4yODMgMTAuMjgtMTEuMjgzIDEwLjI5Yy0uMzkzLjM5LS4zOTMgMS4wMiAwIDEuNDIuMzk1LjM5IDEuMDMzLjM5IDEuNDI3IDBsMTIuMDA3LTEwLjk0Yy4yMS0uMjEuMy0uNDkuMjg0LS43Ny4wMTQtLjI3LS4wNzYtLjU1LS4yODYtLjc2TDEwLjcyIDQuMjkzeiIKICAgICAgICAgIGZpbGw9IiNmZmZmZmYiIG9wYWNpdHk9IjAuOCIgZmlsbC1ydWxlPSJldmVub2RkIi8+Cjwvc3ZnPg==",
        "localPath": null,
        "alt": "next arrow"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/InkedACcZF1b-300x290.jpg",
        "localPath": "assets/image_7.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/facebook.png",
        "localPath": "assets/image_8.png",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/instagram.png",
        "localPath": "assets/image_9.png",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/youtube.png",
        "localPath": "assets/image_10.png",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-photo-Row-1-1024x514.jpg",
        "localPath": "assets/image_11.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-Photo-Row-2-1024x576.jpg",
        "localPath": "assets/image_12.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-Photo-Row-3-1024x576.jpg",
        "localPath": "assets/image_13.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-photo-Row-4-1024x576.jpg",
        "localPath": "assets/image_14.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-photo-Row-1-1024x514.jpg",
        "localPath": "assets/image_15.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-Photo-Row-2-1024x576.jpg",
        "localPath": "assets/image_16.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-Photo-Row-3-1024x576.jpg",
        "localPath": "assets/image_17.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/02/Optimized-About-RICE-photo-Row-4-1024x576.jpg",
        "localPath": "assets/image_18.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-1-1.jpg",
        "localPath": "assets/image_19.jpg",
        "alt": "Interview: Jyoti Mohan Roy  Jyoti shares his childhood memories about desi rice varieties like Gerimuri and Khejurchuri."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-4.jpg",
        "localPath": "assets/image_20.jpg",
        "alt": "Interview: Tarapada Gayen\n  Do you know how many parts a plough has? Tarapada Gayen tells us about the various parts and their local names."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-1.jpg",
        "localPath": "assets/image_21.jpg",
        "alt": "Interview: Jyoti Mohan Roy\n    \n        Farmers grow different varieties of desi rice according to the terrain, low lying or higher lands. \n        Undulation of any land, whether low lying or higher, determines what variety of desi rice will grow well there."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-2.jpg",
        "localPath": "assets/image_22.jpg",
        "alt": "Song: Bishnupada Sarkar   Modern industrial farming forces farmers to migrate to cities as labourers A song pointing out how modern industrial farming makes people jobless in their own villages, forcing them to migrate to cities as labourers"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-3.jpg",
        "localPath": "assets/image_23.jpg",
        "alt": "Interview: Jolil Barkandaj   Arguments for choosing desi paddy varieties over high yielding varieties Would you risk your entire crop, just to get a slightly higher yield? Arguments for choosing desi paddy varieties over high yielding varieties."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-4.jpg",
        "localPath": "assets/image_24.jpg",
        "alt": "Song: Probir Mondal   Despair felt by a farmer in Sundarbans; torn between the love & attachment for one's birthplace & uncertainties. A song expressing despair felt by a farmer in Sundarbans; torn between the love & attachment for one's birthplace and ever present uncertainties"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-5.jpg",
        "localPath": "assets/image_25.jpg",
        "alt": "Interview: Tarak Mandal   Insights of a landless share-cropper on work related migration. Tarak a landless sharecropper who migrates for at least 3 months in a year to work as an agricultural labourer provides an interesting insight"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-6.jpg",
        "localPath": "assets/image_26.jpg",
        "alt": "Interview: Probir Mondal   '8 bighas of desi paddy I grow can sustain upto 20 people for a year' Probir calculates that the 8 bighas of desi paddy that he has cultivated can sustain for a year, 20 people who eat rice as a staple."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-7.jpg",
        "localPath": "assets/image_27.jpg",
        "alt": "Song: Santosh Tarafdar   'In the era of science, the tractor dominates. Farmers do not own seeds anymore.  The 'market' determines everything! A song calling a spade a spade. In the era of science, the tractor dominates.  Farmers do not own seeds anymore. The 'market' determines everything!"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-8.jpg",
        "localPath": "assets/image_28.jpg",
        "alt": "Interview: Proshanto Baidya   Childhood memories of desi paddy sown on flooded fields using a boat. Retrieved from childhood memories, a time when a desi paddy variety was sown on flooded fields using a boat, getting a full crop at the end of the season."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-9-1.jpg",
        "localPath": "assets/image_29.jpg",
        "alt": "Interview: Sita Biswas    Do we imagine agriculture as an equal opportunity sector? Sita shares how she works shoulder to shoulder with her husband.  Sita started learning farming when she was 10-12 years old, today she works shoulder to shoulder with her husband. Do we imagine agriculture as an equal opportunity sector?"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-10.jpg",
        "localPath": "assets/image_30.jpg",
        "alt": "Song: Bishnupada Sarkar   The song questions farmers in Sundarbans.  'A lot has changed in their lives. Or has it?' A song that asks questions to farmers in Sundarbans. A lot has changed in their lives. Or has it?"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/maxresdefault.jpg",
        "localPath": "assets/image_31.jpg",
        "alt": "Interview: Rabindra Aulia   Why does a farmer continue to farm even when it is clear that the costs will not get recovered? Hear some hard truths about farming in Sunderbans from Rabindra."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-3-1.jpg",
        "localPath": "assets/image_32.jpg",
        "alt": "Interview: Jyoti Mohan Roy  The characteristics of a farmland (whether it is low lying and so likely to remain flooded longer or high ground which will not have water for long) determines which paddy variety is suitable to grow there.  Watch Jyoti speak about how natural conditions during the farming season are closely connected with getting a good yield."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-2-1.jpg",
        "localPath": "assets/image_33.jpg",
        "alt": "Interview: Dheeman Boidya  Dheeman explains why it makes more economic sense for him to cultivate desi paddy in his land"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-5.jpg",
        "localPath": "assets/image_34.jpg",
        "alt": "Interview: Palas Mondal  Palas shares how farmers in Sundarbans invoke many gods and goddesses, hoping for a good crop. He speaks about some rituals like jal bhiksha (water begging)"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-1-1.jpg",
        "localPath": "assets/image_35.jpg",
        "alt": "Interview: Jyoti Mohan Roy  Jyoti shares his childhood memories about desi rice varieties like Gerimuri and Khejurchuri."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2023/04/sddefault-4.jpg",
        "localPath": "assets/image_36.jpg",
        "alt": "Interview: Tarapada Gayen\n  Do you know how many parts a plough has? Tarapada Gayen tells us about the various parts and their local names."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-1.jpg",
        "localPath": "assets/image_37.jpg",
        "alt": "Interview: Jyoti Mohan Roy\n    \n        Farmers grow different varieties of desi rice according to the terrain, low lying or higher lands. \n        Undulation of any land, whether low lying or higher, determines what variety of desi rice will grow well there."
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Youtube-Thumbnail-TN-2.jpg",
        "localPath": "assets/image_38.jpg",
        "alt": "Song: Bishnupada Sarkar   Modern industrial farming forces farmers to migrate to cities as labourers A song pointing out how modern industrial farming makes people jobless in their own villages, forcing them to migrate to cities as labourers"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Ananda-Mistry.jpg",
        "localPath": "assets/image_39.jpg",
        "alt": "Ananda Mistry"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Bishnupada-Sarkar.jpg",
        "localPath": "assets/image_40.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Biswajit-Bain.jpg",
        "localPath": "assets/image_41.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Chopol-Pramanik.jpg",
        "localPath": "assets/image_42.jpg",
        "alt": "Chapal Pramanik "
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Nibha-Mondal-min.jpg",
        "localPath": "assets/image_43.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Palas-Mondal-min.jpg",
        "localPath": "assets/image_44.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Pinaki-Roy-min.jpg",
        "localPath": "assets/image_45.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Probir-Mondal-min.jpg",
        "localPath": "assets/image_46.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Rabiul-Islam-min.jpg",
        "localPath": "assets/image_47.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Shruti-Kulkarni-2-min.jpg",
        "localPath": "assets/image_48.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/12/Tarapada-Gayen-min.jpg",
        "localPath": "assets/image_49.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/03/Map-Banner-01-2048x1310.jpg",
        "localPath": "assets/image_50.jpg",
        "alt": ""
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/Website-ui-07.png",
        "localPath": "assets/image_51.png",
        "alt": ""
      }
    ],
    "audio": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/Flute-Solo.mp3",
        "localPath": "assets/audio_52.mp3"
      }
    ]
  },
  {
    "url": "https://ricesub.in/?page_id=1822",
    "title": "Transparency – RiceSub",
    "scrapedAt": "2025-12-05T16:52:55.016Z",
    "textContent": "Skip to content\nMenu\nHOME\nABOUT RICE\nSTORIES\nPEOPLE\nGET INVOLVED\nTRANSPARENCY\nBLOG\n\nTRANSPARENCY\n\n1. Implementing partners:\n\nSundarbans Unnayan Bhawan(SUB) is a Community Based Organisation in Kalitala village ofHingalgunj Block, in North 24 Parganas district of West Bengal. Formed in 1989 the organisation has been able to mobilize local action on issues of concern in the community despite chronic resource shortages\nThe Ecological Foundation (ELF) – Registered in Delhi as a not-for-profit Trust in September 2014, ELF is a space for inspiration, incubation; of support and rejuvenation; for finding oneself and others; a space that believes in the power of anyone and everyone to make a difference\n\n2. RICE pilot was supported by ONGC CSR – project budget (Jul-Dec 2021)\n\nA) Social Media Content Development:\t \t2,24,000\n1)  Honorarium for photographer @ Rs 10,000/- per month x 6 month\t60,000\t \n\n\n2)  Prizes for creative content development by village (poems/ songs /etc)\n\n     @ Rs 1,500 each x 8 per month x 6 months)\n\n\t72,000\t \n3)  Social media tech support @ Rs 12,000/- per month x 6 months\t72,000\t \n4)    Promotions & outreach (lumpsum as per actuals)\t20,000\t \nB) Developing rice processing capacity for the villagers\t \t95,000\n1)  Training on operating processing machine (15 SHG members)\t20,000\t \n2)  Purchase of processing  machine @  Rs 15 ,000 each for 2 SHGs\t30,000\t \n3) Transport cost for 2 processing machines (lumpsum as per actuals)\t5,000\t \n4) Grant to 4 SHGs for building traditional bamboo grain storage\nspaces @ Rs 10,000 per bamboo structure)\t40,000\t \n\nC) Project management\n\n\t \t\n\n120000\n\n\n\n\n1) Honorarium for 1 project coordinator @ Rs 5,000/- per  month x 6\n\n\t\n\n30,000\n\n\t \n\n\n2) Honorarium for 2 field coordinators @ Rs 5,000/- per month x 2 x 6\n\n\t\n\n60,000\n\n\t \n\n\n3) Travel & communications costs (Lumpsum as per actuals)\n\n\t\n\n30,000\n\n\t \n\nD) Sundry Expenses\n\n\t \t\n\n11,000\n\n\n\n\n \n\n\tTotal\t\n\n4,50,000\n\n©RICE. 2021\n\nHome\n\nAbout RICE\n\nStories\n\nPeople\n\nGet Involved\n\nTransparency\n\nRICE pilot was supported by ONGC CSR\n\nFacebook\n\nInstagram\n\nYoutube\n\nBlog\n\nPowered by Wherrelz IT Solutions Ltd",
    "images": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/cropped-rice-logo-04.jpg",
        "localPath": "assets/image_53.jpg",
        "alt": "RiceSub"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/Website-ui-07.png",
        "localPath": "assets/image_54.png",
        "alt": ""
      }
    ],
    "audio": []
  },
  {
    "url": "https://ricesub.in/news",
    "title": "News – RiceSub",
    "scrapedAt": "2025-12-05T16:52:56.620Z",
    "textContent": "Skip to content\nMenu\nHOME\nABOUT RICE\nSTORIES\nPEOPLE\nGET INVOLVED\nTRANSPARENCY\nBLOG\nNEWS\nNothing Found\n\nIt seems we can’t find what you’re looking for. Perhaps searching can help.\n\nSearch for:\n\n©RICE. 2021\n\nHome\n\nAbout RICE\n\nStories\n\nPeople\n\nGet Involved\n\nTransparency\n\nRICE pilot was supported by ONGC CSR\n\nFacebook\n\nInstagram\n\nYoutube\n\nBlog\n\nPowered by Wherrelz IT Solutions Ltd",
    "images": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/cropped-rice-logo-04.jpg",
        "localPath": "assets/image_55.jpg",
        "alt": "RiceSub"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/Website-ui-07.png",
        "localPath": "assets/image_56.png",
        "alt": ""
      }
    ],
    "audio": []
  },
  {
    "url": "https://ricesub.in/transparency/",
    "title": "Transparency – RiceSub",
    "scrapedAt": "2025-12-05T16:52:57.426Z",
    "textContent": "Skip to content\nMenu\nHOME\nABOUT RICE\nSTORIES\nPEOPLE\nGET INVOLVED\nTRANSPARENCY\nBLOG\n\nTRANSPARENCY\n\n1. Implementing partners:\n\nSundarbans Unnayan Bhawan(SUB) is a Community Based Organisation in Kalitala village ofHingalgunj Block, in North 24 Parganas district of West Bengal. Formed in 1989 the organisation has been able to mobilize local action on issues of concern in the community despite chronic resource shortages\nThe Ecological Foundation (ELF) – Registered in Delhi as a not-for-profit Trust in September 2014, ELF is a space for inspiration, incubation; of support and rejuvenation; for finding oneself and others; a space that believes in the power of anyone and everyone to make a difference\n\n2. RICE pilot was supported by ONGC CSR – project budget (Jul-Dec 2021)\n\nA) Social Media Content Development:\t \t2,24,000\n1)  Honorarium for photographer @ Rs 10,000/- per month x 6 month\t60,000\t \n\n\n2)  Prizes for creative content development by village (poems/ songs /etc)\n\n     @ Rs 1,500 each x 8 per month x 6 months)\n\n\t72,000\t \n3)  Social media tech support @ Rs 12,000/- per month x 6 months\t72,000\t \n4)    Promotions & outreach (lumpsum as per actuals)\t20,000\t \nB) Developing rice processing capacity for the villagers\t \t95,000\n1)  Training on operating processing machine (15 SHG members)\t20,000\t \n2)  Purchase of processing  machine @  Rs 15 ,000 each for 2 SHGs\t30,000\t \n3) Transport cost for 2 processing machines (lumpsum as per actuals)\t5,000\t \n4) Grant to 4 SHGs for building traditional bamboo grain storage\nspaces @ Rs 10,000 per bamboo structure)\t40,000\t \n\nC) Project management\n\n\t \t\n\n120000\n\n\n\n\n1) Honorarium for 1 project coordinator @ Rs 5,000/- per  month x 6\n\n\t\n\n30,000\n\n\t \n\n\n2) Honorarium for 2 field coordinators @ Rs 5,000/- per month x 2 x 6\n\n\t\n\n60,000\n\n\t \n\n\n3) Travel & communications costs (Lumpsum as per actuals)\n\n\t\n\n30,000\n\n\t \n\nD) Sundry Expenses\n\n\t \t\n\n11,000\n\n\n\n\n \n\n\tTotal\t\n\n4,50,000\n\n©RICE. 2021\n\nHome\n\nAbout RICE\n\nStories\n\nPeople\n\nGet Involved\n\nTransparency\n\nRICE pilot was supported by ONGC CSR\n\nFacebook\n\nInstagram\n\nYoutube\n\nBlog\n\nPowered by Wherrelz IT Solutions Ltd",
    "images": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/cropped-rice-logo-04.jpg",
        "localPath": "assets/image_57.jpg",
        "alt": "RiceSub"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/Website-ui-07.png",
        "localPath": "assets/image_58.png",
        "alt": ""
      }
    ],
    "audio": []
  },
  {
    "url": "https://ricesub.in/news/",
    "title": "News – RiceSub",
    "scrapedAt": "2025-12-05T16:52:58.210Z",
    "textContent": "Skip to content\nMenu\nHOME\nABOUT RICE\nSTORIES\nPEOPLE\nGET INVOLVED\nTRANSPARENCY\nBLOG\nNEWS\nNothing Found\n\nIt seems we can’t find what you’re looking for. Perhaps searching can help.\n\nSearch for:\n\n©RICE. 2021\n\nHome\n\nAbout RICE\n\nStories\n\nPeople\n\nGet Involved\n\nTransparency\n\nRICE pilot was supported by ONGC CSR\n\nFacebook\n\nInstagram\n\nYoutube\n\nBlog\n\nPowered by Wherrelz IT Solutions Ltd",
    "images": [
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2022/01/cropped-rice-logo-04.jpg",
        "localPath": "assets/image_59.jpg",
        "alt": "RiceSub"
      },
      {
        "originalSrc": "https://ricesub.in/wp-content/uploads/2021/11/Website-ui-07.png",
        "localPath": "assets/image_60.png",
        "alt": ""
      }
    ],
    "audio": []
  }
]